XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2B21A_DFP.pdsc
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.component.serial_manager, driver.common, device=K32L2B21A.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, driver.common, device=K32L2B21A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.K32L2B21A.internal_condition"/>
    </condition>
    <condition id="component.software_crc_adapter.condition_id">
      <require condition="allOf.driver.common, device=K32L2B21A.internal_condition"/>
    </condition>
    <condition id="component.software_rng_adapter.condition_id">
      <require condition="allOf.driver.common, device=K32L2B21A.internal_condition"/>
    </condition>
    <condition id="component.spi_adapter.condition_id">
      <require condition="allOf.driver.common, driver.spi, device=K32L2B21A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.spi, device=K32L2B21A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require condition="device.K32L2B21A.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.driver.common, component.lists, anyOf=component.tpm_adapter, component.lptmr_adapter, component.pit_adapter, device=K32L2B21A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.lists, anyOf=component.tpm_adapter, component.lptmr_adapter, component.pit_adapter, device=K32L2B21A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="anyOf.component.tpm_adapter, component.lptmr_adapter, component.pit_adapter.internal_condition"/>
      <require condition="device.K32L2B21A.internal_condition"/>
    </condition>
    <condition id="anyOf.component.tpm_adapter, component.lptmr_adapter, component.pit_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="tpm_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr_adapter"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="pit_adapter"/>
    </condition>
    <condition id="component.tpm_adapter.condition_id">
      <require condition="allOf.driver.common, driver.tpm, device=K32L2B21A.internal_condition"/>
    </condition>
    <condition id="component.uart_adapter.condition_id">
      <require condition="allOf.driver.common, driver.uart, device=K32L2B21A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.uart, device=K32L2B21A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require condition="device.K32L2B21A.internal_condition"/>
    </condition>
    <condition id="device.K32L2B21A_CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device_id=K32L2B21xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device_id=K32L2B21xxxxA.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device_id.K32L2B21xxxxA.internal_condition"/>
    </condition>
    <condition id="device.K32L2B21A_linker.condition_id">
      <require condition="allOf.device_id=K32L2B21xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=K32L2B21xxxxA.internal_condition">
      <require condition="device_id.K32L2B21xxxxA.internal_condition"/>
    </condition>
    <condition id="device_ids.K32L2B21xxxxA.internal_condition">
      <accept Dname="K32L2B21VFM0A" Dvendor="NXP:11"/>
      <accept Dname="K32L2B21VFT0A" Dvendor="NXP:11"/>
      <accept Dname="K32L2B21VLH0A" Dvendor="NXP:11"/>
      <accept Dname="K32L2B21VMP0A" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, device_ids=K32L2B21xxxxA.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="device_ids.K32L2B21xxxxA.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, device_ids=K32L2B21xxxxA.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="device_ids.K32L2B21xxxxA.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
    <condition id="allOf.toolchains=iar, device_ids=K32L2B21xxxxA.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="device_ids.K32L2B21xxxxA.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="device.K32L2B21A_startup.condition_id">
      <require condition="allOf.device.K32L2B21A_system, device=K32L2B21A.internal_condition"/>
    </condition>
    <condition id="allOf.device.K32L2B21A_system, device=K32L2B21A.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="K32L2B21A_system"/>
      <require condition="device.K32L2B21A.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
    </condition>
    <condition id="device.K32L2B21A_system.condition_id">
      <require condition="allOf.device.K32L2B21A_CMSIS, device=K32L2B21A.internal_condition"/>
    </condition>
    <condition id="allOf.device.K32L2B21A_CMSIS, device=K32L2B21A.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="K32L2B21A_header"/>
      <require condition="device.K32L2B21A.internal_condition"/>
    </condition>
    <condition id="driver.adc16.condition_id">
      <require condition="allOf.device_id=K32L2B21xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=K32L2B21xxxxA, driver.common.internal_condition">
      <require condition="device_id.K32L2B21xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.driver.common, device=K32L2B21A.internal_condition"/>
    </condition>
    <condition id="driver.cmp.condition_id">
      <require condition="allOf.device_id=K32L2B21xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_i2c.condition_id">
      <require condition="allOf.driver.i2c_dma, device_id=K32L2B21xxxxA, driver.i2c, CMSIS_Driver_Include.I2C, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.i2c_dma, device_id=K32L2B21xxxxA, driver.i2c, CMSIS_Driver_Include.I2C, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_dma"/>
      <require condition="device_id.K32L2B21xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
