XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2B21A_DFP.pdsc
    <condition id="driver.cmsis_lpuart.condition_id">
      <require condition="allOf.driver.lpuart_dma, device_id=K32L2B21xxxxA, driver.lpuart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpuart_dma, device_id=K32L2B21xxxxA, driver.lpuart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_dma"/>
      <require condition="device_id.K32L2B21xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.cmsis_spi.condition_id">
      <require condition="allOf.driver.spi_dma, device_id=K32L2B21xxxxA, driver.spi, CMSIS_Driver_Include.SPI, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.spi_dma, device_id=K32L2B21xxxxA, driver.spi, CMSIS_Driver_Include.SPI, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma"/>
      <require condition="device_id.K32L2B21xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.cmsis_uart.condition_id">
      <require condition="allOf.driver.uart_dma, device_id=K32L2B21xxxxA, driver.uart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition"/>
    </condition>
    <condition id="allOf.driver.uart_dma, device_id=K32L2B21xxxxA, driver.uart, CMSIS_Driver_Include.USART, RTE_Device.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_dma"/>
      <require condition="device_id.K32L2B21xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.driver.clock, device.K32L2B21A_CMSIS, device=K32L2B21A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.clock, device.K32L2B21A_CMSIS, device=K32L2B21A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="CMSIS" Csub="K32L2B21A_header"/>
      <require condition="device.K32L2B21A.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm0p.condition_id">
      <require condition="cores.cm0p.internal_condition"/>
    </condition>
    <condition id="cores.cm0p.internal_condition">
      <accept Dcore="Cortex-M0+"/>
    </condition>
    <condition id="driver.cop.condition_id">
      <require condition="allOf.device_id=K32L2B21xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.dac.condition_id">
      <require condition="allOf.device_id=K32L2B21xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.dma.condition_id">
      <require condition="allOf.device_id=K32L2B21xxxxA, driver.dmamux, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=K32L2B21xxxxA, driver.dmamux, driver.common.internal_condition">
      <require condition="device_id.K32L2B21xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="driver.dmamux.condition_id">
      <require condition="allOf.device_id=K32L2B21xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.flash.condition_id">
      <require condition="allOf.driver.common, device=K32L2B21A.internal_condition"/>
    </condition>
    <condition id="driver.flexio.condition_id">
      <require condition="allOf.device_id=K32L2B21xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2c_master.condition_id">
      <require condition="allOf.driver.flexio, device=K32L2B21A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device=K32L2B21A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device.K32L2B21A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2s.condition_id">
      <require condition="allOf.driver.flexio, device=K32L2B21A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2s_dma.condition_id">
      <require condition="allOf.driver.dma, driver.flexio_i2s, device=K32L2B21A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dma, driver.flexio_i2s, device=K32L2B21A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s"/>
      <require condition="device.K32L2B21A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi.condition_id">
      <require condition="allOf.driver.flexio, device=K32L2B21A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi_dma.condition_id">
      <require condition="allOf.driver.dma, driver.flexio_spi, device=K32L2B21A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dma, driver.flexio_spi, device=K32L2B21A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi"/>
      <require condition="device.K32L2B21A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart.condition_id">
      <require condition="allOf.driver.flexio, device=K32L2B21A.internal_condition"/>
    </condition>
